src/Catalogs/СтруктураСайта/СтруктураСайта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураСайта</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипФайла</name>
    <type>
      <types>EnumRef.ТипыФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыФайлов/ТипыФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФайлов</name>
  <enumValues>
    <name>Текстовый</name>
  </enumValues>
  <enumValues>
    <name>Двоичный</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СтруктураСайта/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ТипФайла) Тогда
		Объект.ТипФайла = ПредопределенноеЗначение("Перечисление.ТипыФайлов.Текстовый");	
	КонецЕсли;
	
	ВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыборФайлаОткрытие(Элемент, СтандартнаяОбработка)
	Диалог 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок 		= "Выберите файл";
	ОповещениеЗавершения 	= Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);

КонецПроцедуры

&НаКлиенте
Процедура ТипФайлаПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда	
		Путь = ВыбранныеФайлы[0];
		ЗаписатьДвоичныеДанныеФайла(Новый ДвоичныеДанные(Путь));	
		
		Закрыть();
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(ЭтотОбъект));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДвоичныеДанныеФайла(ДД)
	
	Записать();
	//@skip-check unknown-method-property
	ОбъектФайл 				= Объект.Ссылка.ПолучитьОбъект();
	ОбъектФайл.Хранилище 	= Новый ХранилищеЗначения(ДД);
	ОбъектФайл.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьЭлементов()
	
	Если Объект.ТипФайла = ПредопределенноеЗначение("Перечисление.ТипыФайлов.Текстовый") Тогда
		Элементы.ВыборФайла.Видимость = Ложь;
		Элементы.Текст.Видимость = Истина;
	Иначе
		Элементы.ВыборФайла.Видимость = Истина;
		Элементы.Текст.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
